status/src/2023/1229.org
#+TITLE: 23 December 2023 - 29 December 2023

Another Year Gone!

* MIT OCW
** 18.03sc (differential equations).
*** Unit IV - Final Review
Still ongoing.
** 18.06sc (Linear Algebra)
Textbook arriving soon.
* bwmse
** Continuing updates resulting from 18.03 review
* wood chips
No progress. Rainy...
* SCZ Front Step
No progress. Rainy...
* SCZ Garbage Disposal Replacement
done
* SCZ "China Cup Candle" glue job.
Interesting how a FedEx driver packing job and FexEx shipment resulted
in broken china.
* Various i686
*** netbsd
installed.
*** buildroot
builds complete.
* piper
** dovecot
*** Raising apparmor error.
Not sure how to resolve.
** pidgeonhole
*** procmail replacement.
*** Considering integration.
** httpd
*** Still stable.
