status/2023/1229.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-06 Sat 06:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>23 December 2023 - 29 December 2023</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">23 December 2023 - 29 December 2023</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgec8e77b">1. MIT OCW</a>
<ul>
<li><a href="#org45f71b4">1.1. 18.03sc (differential equations).</a>
<ul>
<li><a href="#org5b7ade1">1.1.1. Unit IV - Final Review</a></li>
</ul>
</li>
<li><a href="#orgd743a03">1.2. 18.06sc (Linear Algebra)</a></li>
</ul>
</li>
<li><a href="#org60605e5">2. bwmse</a>
<ul>
<li><a href="#org4888052">2.1. Continuing updates resulting from 18.03 review</a></li>
</ul>
</li>
<li><a href="#org53fd355">3. wood chips</a></li>
<li><a href="#orgcfa527d">4. SCZ Front Step</a></li>
<li><a href="#org56900b4">5. SCZ Garbage Disposal Replacement</a></li>
<li><a href="#org3db8e0e">6. SCZ "China Cup Candle" glue job.</a></li>
<li><a href="#org7bd70c9">7. Various i686</a>
<ul>
<li>
<ul>
<li><a href="#org77b882f">7.0.1. netbsd</a></li>
<li><a href="#orge8007c2">7.0.2. buildroot</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8de9e0a">8. piper</a>
<ul>
<li><a href="#org8d4d521">8.1. dovecot</a>
<ul>
<li><a href="#org31d92fd">8.1.1. Raising apparmor error.</a></li>
</ul>
</li>
<li><a href="#orgf52d2a0">8.2. pidgeonhole</a>
<ul>
<li><a href="#org1b8c058">8.2.1. procmail replacement.</a></li>
<li><a href="#org93698f7">8.2.2. Considering integration.</a></li>
</ul>
</li>
<li><a href="#org71593d2">8.3. httpd</a>
<ul>
<li><a href="#org6a88535">8.3.1. Still stable.</a></li>
</ul>
</li>
<li><a href="#org14b1860">8.4. SSL cert</a></li>
<li><a href="#org9886588">8.5. redmine</a></li>
<li><a href="#orgc569edf">8.6. openvpn</a></li>
</ul>
</li>
<li><a href="#orga016325">9. Buffalo WZR-HP-G300NH</a>
<ul>
<li><a href="#orgc1a007f">9.1. Update</a></li>
</ul>
</li>
<li><a href="#orgcd9f286">10. SJC weather station</a>
<ul>
<li><a href="#org3500b1d">10.1. Still having wireless connectivity problems</a></li>
<li><a href="#orgcadf423">10.2. Really <b>Really</b> should put CPU in a proper enclosure</a></li>
</ul>
</li>
<li><a href="#org23c7d9b">11. cipher-puzzle</a>
<ul>
<li><a href="#orgc146177">11.1. more fixes and tweaks</a></li>
</ul>
</li>
<li><a href="#org52a1690">12. opencl</a>
<ul>
<li><a href="#org8fbf328">12.1. Studying. Have some examples working.</a></li>
<li><a href="#orgb8e92f0">12.2. Need to look at arrayfire as an alternative.</a></li>
<li><a href="#orgb1d67c1">12.3. This is a bit of a hammer looking for a nail.</a></li>
</ul>
</li>
<li><a href="#orgd7e0178">13. EPLDH</a>
<ul>
<li><a href="#org33f1ded">13.1. MPFI interval arithmetic better alternative</a></li>
</ul>
</li>
<li><a href="#org09920d3">14. wktpqb</a>
<ul>
<li><a href="#org282baa5">14.1. needs a new approach</a></li>
<li><a href="#org6076d63">14.2. Verifying edge construction (con't.)</a></li>
<li><a href="#org0966d09">14.3. 'gcd' algorithm doesn't work</a></li>
</ul>
</li>
<li><a href="#org654b004">15. Compilers</a>
<ul>
<li><a href="#orgf86cbb5">15.1. Started extracting C++ standard grammar</a>
<ul>
<li><a href="#org14e251d">15.1.1. Interesting how the grammar is not completely formal.</a></li>
<li><a href="#org233aa70">15.1.2. Extracting from latex sources.</a></li>
</ul>
</li>
<li><a href="#org973ecf4">15.2. Started hand written WSN parser</a></li>
</ul>
</li>
<li><a href="#org12c0782">16. Mill Controller #2</a>
<ul>
<li><a href="#org072c4f1">16.1. Mounted on mill - ready or testing</a></li>
<li><a href="#org167650c">16.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#org61842b6">16.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#orgf062c5b">16.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
<li><a href="#org1873644">16.3. Alternative architecture</a>
<ul>
<li><a href="#org526b5c5">16.3.1. Split off stepper motor controller to separate board</a></li>
<li><a href="#org00332f6">16.3.2. Use emc2 MODBUS/TCP protocol for stepper and other IO</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org810e668">17. Alum Rock Data Center</a>
<ul>
<li><a href="#orga8ba7d3">17.1. Need a VPS with static IP</a>
<ul>
<li><a href="#org4d2c76f">17.1.1. OpenVPN to tie it all together</a></li>
<li><a href="#orgaf9c4ab">17.1.2. Gandi VPS datacenter in France so connection crosses international border</a></li>
<li><a href="#orgdf00526">17.1.3. Prototype VPS on existing hardware</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7a63a50">18. CA Root Key Generation</a>
<ul>
<li><a href="#orgd887f53">18.1. Need to be clear on security properties.</a></li>
<li><a href="#org03b1c3c">18.2. Simple hardware.</a>
<ul>
<li><a href="#orgbc8041b">18.2.1. Use some modern device TPM</a></li>
<li><a href="#org4427f48">18.2.2. Or something that uses PKCS11 interface</a></li>
</ul>
</li>
<li><a href="#org323a955">18.3. USB Serial interface only but no credentials across USB I/F.</a></li>
<li><a href="#org92c6025">18.4. Use Sneakernet</a></li>
</ul>
</li>
<li><a href="#org5231aa6">19. Virtual Orchestra</a>
<ul>
<li><a href="#org6a8b5be">19.1. sfz file tests</a>
<ul>
<li><a href="#orga519703">19.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org092624e">19.2. increasingly skeptical whether quality results are possible</a></li>
<li><a href="#orgc38b502">19.3. maybe should treat as platform for concatinative synthesis</a></li>
<li><a href="#org6b3cff2">19.4. maybe should just accept the limitations and work with it</a></li>
</ul>
</li>
<li><a href="#org30c96a9">20. gat</a>
<ul>
<li><a href="#org68bf08e">20.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#org49a3f05">21. RIOT drivers</a>
<ul>
<li><a href="#org906e3fa">21.1. WS2801</a></li>
<li><a href="#org154db26">21.2. Velleman KA03</a></li>
<li><a href="#org87a89a6">21.3. Velleman KA05</a></li>
</ul>
</li>
<li><a href="#org1c81c12">22. mcd05 32 button/led box</a>
<ul>
<li><a href="#org0d635c4">22.1. Recovered schematics.</a></li>
<li><a href="#orgb13e76f">22.2. Planning software.</a></li>
<li><a href="#org20065e3">22.3. Received STM32F767 Nucleo144 with Ethernet.</a>
<ul>
<li><a href="#orgcfa97b2">22.3.1. Test program running.</a></li>
<li><a href="#org28106e3">22.3.2. Need to consider CoAP multicast discovery.</a></li>
<li><a href="#org84f1c0c">22.3.3. Consider simpler architecture with STM32F767 as a 'hub'.</a></li>
<li><a href="#orgf186dfa">22.3.4. Consider CAN interface to hub.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org507b58d">23. AMD 2900 bitslice computing</a>
<ul>
<li><a href="#org910a981">23.1. Probably my oldest uncompleted project</a></li>
<li><a href="#org24cd4f8">23.2. Exploring possibilities for something constructive</a></li>
</ul>
</li>
<li><a href="#orgaaef45e">24. Hitachi HD68B09E CPU</a>
<ul>
<li><a href="#orgc1e37ce">24.1. RAM/UART/IO</a></li>
<li><a href="#orgac3d261">24.2. Started schematic</a>
<ul>
<li><a href="#orgeea67ad">24.2.1. Standard peripheral set for 8 bit CPU bringups</a></li>
</ul>
</li>
<li><a href="#org235fcce">24.3. Arduino Mega 2560 DMA loader</a></li>
<li><a href="#org50c687b">24.4. Generate quadrature clock directly</a></li>
<li><a href="#org0d409fe">24.5. Full Bus SW Emulation infeasible</a></li>
</ul>
</li>
<li><a href="#org449cd66">25. Rockwell R65F11</a>
<ul>
<li><a href="#org47340f5">25.1. Still evaluating.</a></li>
<li><a href="#orge48761e">25.2. Dev board</a></li>
</ul>
</li>
<li><a href="#orgec51adf">26. PLD programming</a></li>
<li><a href="#org08090fe">27. EPROM Programming</a></li>
<li><a href="#orgff429c1">28. POSIT</a>
<ul>
<li><a href="#org62b513d">28.1. Use POSITs for YRX?</a></li>
</ul>
</li>
<li><a href="#org1e70461">29. MAME</a>
<ul>
<li><a href="#org02a5c12">29.1. Subset builds in debug mode</a></li>
<li><a href="#org18bc0f4">29.2. gs6809 serial IO doesn't work right with PTY and other streams</a></li>
<li><a href="#orgaff1b1c">29.3. ampro (Z80/Z80SIO) <b>does</b> work with PTY</a></li>
<li><a href="#org93d337d">29.4. Evaluating what is needed for other emulators.</a></li>
</ul>
</li>
<li><a href="#orgcf03a17">30. More project ideas</a>
<ul>
<li><a href="#org1a2d75a">30.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org3749c71">30.2. GMPForth ports to simulators</a>
<ul>
<li><a href="#org330471d">30.2.1. SIMH for some targets (vax)</a></li>
<li><a href="#org6207de5">30.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org3b1d2ca">30.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org5005783">30.3. GMPASM assembler</a></li>
<li><a href="#org05bb87d">30.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org63ef5fe">30.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgb67617c">30.5.1. Offline compilation</a></li>
<li><a href="#org5c26a04">30.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org96851b8">30.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#org31090e4">30.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#orgfa80f10">30.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#org62170b4">30.6.3. CPUs with totally async bus may be supportable without RAM</a></li>
<li><a href="#orgf6b5e61">30.6.4. Could use small footprint monitor in asm (gmpmon?)</a></li>
</ul>
</li>
<li><a href="#org660145e">30.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#org2e4c2d2">30.7.1. OSI Superboard</a></li>
<li><a href="#org8e8efa9">30.7.2. Super Jolt</a></li>
<li><a href="#orgf786543">30.7.3. Ampro Little Board</a></li>
<li><a href="#orge273306">30.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orgf568a15">30.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org09a5770">31. David Davies</a>
<ul>
<li><a href="#org4890159">31.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org3321d62">31.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#orgffb0587">31.3. Next hearing 2/26/2024</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Another Year Gone!
</p>

<div id="outline-container-orgec8e77b" class="outline-2">
<h2 id="orgec8e77b"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org45f71b4" class="outline-3">
<h3 id="org45f71b4"><span class="section-number-3">1.1.</span> 18.03sc (differential equations).</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org5b7ade1" class="outline-4">
<h4 id="org5b7ade1"><span class="section-number-4">1.1.1.</span> Unit IV - Final Review</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Still ongoing.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd743a03" class="outline-3">
<h3 id="orgd743a03"><span class="section-number-3">1.2.</span> 18.06sc (Linear Algebra)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Textbook arriving soon.
</p>
</div>
</div>
</div>
<div id="outline-container-org60605e5" class="outline-2">
<h2 id="org60605e5"><span class="section-number-2">2.</span> bwmse</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4888052" class="outline-3">
<h3 id="org4888052"><span class="section-number-3">2.1.</span> Continuing updates resulting from 18.03 review</h3>
</div>
</div>
<div id="outline-container-org53fd355" class="outline-2">
<h2 id="org53fd355"><span class="section-number-2">3.</span> wood chips</h2>
<div class="outline-text-2" id="text-3">
<p>
No progress. Rainy&#x2026;
</p>
</div>
</div>
<div id="outline-container-orgcfa527d" class="outline-2">
<h2 id="orgcfa527d"><span class="section-number-2">4.</span> SCZ Front Step</h2>
<div class="outline-text-2" id="text-4">
<p>
No progress. Rainy&#x2026;
</p>
</div>
</div>
<div id="outline-container-org56900b4" class="outline-2">
<h2 id="org56900b4"><span class="section-number-2">5.</span> SCZ Garbage Disposal Replacement</h2>
<div class="outline-text-2" id="text-5">
<p>
done
</p>
</div>
</div>
<div id="outline-container-org3db8e0e" class="outline-2">
<h2 id="org3db8e0e"><span class="section-number-2">6.</span> SCZ "China Cup Candle" glue job.</h2>
<div class="outline-text-2" id="text-6">
<p>
Interesting how a FedEx driver packing job and FexEx shipment resulted
in broken china.
</p>
</div>
</div>
<div id="outline-container-org7bd70c9" class="outline-2">
<h2 id="org7bd70c9"><span class="section-number-2">7.</span> Various i686</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org77b882f" class="outline-4">
<h4 id="org77b882f"><span class="section-number-4">7.0.1.</span> netbsd</h4>
<div class="outline-text-4" id="text-7-0-1">
<p>
installed.
</p>
</div>
</div>
<div id="outline-container-orge8007c2" class="outline-4">
<h4 id="orge8007c2"><span class="section-number-4">7.0.2.</span> buildroot</h4>
<div class="outline-text-4" id="text-7-0-2">
<p>
builds complete.
</p>
</div>
</div>
</div>
<div id="outline-container-org8de9e0a" class="outline-2">
<h2 id="org8de9e0a"><span class="section-number-2">8.</span> piper</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org8d4d521" class="outline-3">
<h3 id="org8d4d521"><span class="section-number-3">8.1.</span> dovecot</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org31d92fd" class="outline-4">
<h4 id="org31d92fd"><span class="section-number-4">8.1.1.</span> Raising apparmor error.</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
Not sure how to resolve.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf52d2a0" class="outline-3">
<h3 id="orgf52d2a0"><span class="section-number-3">8.2.</span> pidgeonhole</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-org1b8c058" class="outline-4">
<h4 id="org1b8c058"><span class="section-number-4">8.2.1.</span> procmail replacement.</h4>
</div>
<div id="outline-container-org93698f7" class="outline-4">
<h4 id="org93698f7"><span class="section-number-4">8.2.2.</span> Considering integration.</h4>
</div>
</div>
