status/src/2023/1229.org
** SSL cert
Trying letsencrypt with certbot. http problem above may be interfering.
** redmine
Still not sure I want to go down this rabbit hole.
** openvpn
Need to consider cert construction.
* Buffalo WZR-HP-G300NH
** Update
Sometime next year.
* SJC weather station
** Still having wireless connectivity problems
Need 20m cable.
** Really *Really* should put CPU in a proper enclosure
* cipher-puzzle
** more fixes and tweaks
* opencl
** Studying. Have some examples working.
** Need to look at arrayfire as an alternative.
** This is a bit of a hammer looking for a nail.
* EPLDH
** MPFI interval arithmetic better alternative
* wktpqb
** needs a new approach
** Verifying edge construction (con't.)
** 'gcd' algorithm doesn't work
* Compilers
** Started extracting C++ standard grammar
*** Interesting how the grammar is not completely formal.
*** Extracting from latex sources.
** Started hand written WSN parser
* Mill Controller #2
** Mounted on mill - ready or testing
** Need to investigate new HW/SW for eventual replacements
*** Old crap ain't gonna last forever
*** Buildroot/Linux 5.15 PREEMPT + latency tools
First pass done - boots on real hardware
** Alternative architecture
*** Split off stepper motor controller to separate board
Increase latency tolerance on controller
*** Use emc2 MODBUS/TCP protocol for stepper and other IO
* Alum Rock Data Center
** Need a VPS with static IP
*** OpenVPN to tie it all together
*** Gandi VPS datacenter in France so connection crosses international border
What are the data security and privacy tradeoffs?
*** Prototype VPS on existing hardware
**** OpenStack?
* CA Root Key Generation
Nice to have an appliance that manages keys.
Need to make this simple. Really don't have time for a science project.
Could just buy something from nitrokey https://www.nitrokey.com/
But I really don't want to spend money on it of I have hardware already.
** Need to be clear on security properties.
Definitely protect against remote access to private keys. How strong
does the protection against *local* access need to be?
** Simple hardware.
*** Use some modern device TPM
Need to export data for backup.
*** Or something that uses PKCS11 interface
** USB Serial interface only but no credentials across USB I/F.
But this potentially exposes the hardware to remote access via the USB
I/F when connected.
** Use Sneakernet
Doesn't scale. Should use something so cert updates are automatable.
But that's a science project it seems.
* Virtual Orchestra
** sfz file tests
*** need tooling to edit sample files
** increasingly skeptical whether quality results are possible
** maybe should treat as platform for concatinative synthesis
** maybe should just accept the limitations and work with it
One should not be disappointed that a guitar can't sound like a flute.
* gat
** spectrogram done - matches 'octave' output
* RIOT drivers
Implemented - needs testing.
** WS2801
** Velleman KA03
** Velleman KA05
* mcd05 32 button/led box
