status/2023/1229.html
<div id="outline-container-org71593d2" class="outline-3">
<h3 id="org71593d2"><span class="section-number-3">8.3.</span> httpd</h3>
<div class="outline-text-3" id="text-8-3">
</div>
<div id="outline-container-org6a88535" class="outline-4">
<h4 id="org6a88535"><span class="section-number-4">8.3.1.</span> Still stable.</h4>
</div>
</div>
<div id="outline-container-org14b1860" class="outline-3">
<h3 id="org14b1860"><span class="section-number-3">8.4.</span> SSL cert</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Trying letsencrypt with certbot. http problem above may be interfering.
</p>
</div>
</div>
<div id="outline-container-org9886588" class="outline-3">
<h3 id="org9886588"><span class="section-number-3">8.5.</span> redmine</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Still not sure I want to go down this rabbit hole.
</p>
</div>
</div>
<div id="outline-container-orgc569edf" class="outline-3">
<h3 id="orgc569edf"><span class="section-number-3">8.6.</span> openvpn</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Need to consider cert construction.
</p>
</div>
</div>
</div>
<div id="outline-container-orga016325" class="outline-2">
<h2 id="orga016325"><span class="section-number-2">9.</span> Buffalo WZR-HP-G300NH</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgc1a007f" class="outline-3">
<h3 id="orgc1a007f"><span class="section-number-3">9.1.</span> Update</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Sometime next year.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcd9f286" class="outline-2">
<h2 id="orgcd9f286"><span class="section-number-2">10.</span> SJC weather station</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org3500b1d" class="outline-3">
<h3 id="org3500b1d"><span class="section-number-3">10.1.</span> Still having wireless connectivity problems</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Need 20m cable.
</p>
</div>
</div>
<div id="outline-container-orgcadf423" class="outline-3">
<h3 id="orgcadf423"><span class="section-number-3">10.2.</span> Really <b>Really</b> should put CPU in a proper enclosure</h3>
</div>
</div>
<div id="outline-container-org23c7d9b" class="outline-2">
<h2 id="org23c7d9b"><span class="section-number-2">11.</span> cipher-puzzle</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgc146177" class="outline-3">
<h3 id="orgc146177"><span class="section-number-3">11.1.</span> more fixes and tweaks</h3>
</div>
</div>
<div id="outline-container-org52a1690" class="outline-2">
<h2 id="org52a1690"><span class="section-number-2">12.</span> opencl</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org8fbf328" class="outline-3">
<h3 id="org8fbf328"><span class="section-number-3">12.1.</span> Studying. Have some examples working.</h3>
</div>
<div id="outline-container-orgb8e92f0" class="outline-3">
<h3 id="orgb8e92f0"><span class="section-number-3">12.2.</span> Need to look at arrayfire as an alternative.</h3>
</div>
<div id="outline-container-orgb1d67c1" class="outline-3">
<h3 id="orgb1d67c1"><span class="section-number-3">12.3.</span> This is a bit of a hammer looking for a nail.</h3>
</div>
</div>
<div id="outline-container-orgd7e0178" class="outline-2">
<h2 id="orgd7e0178"><span class="section-number-2">13.</span> EPLDH</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org33f1ded" class="outline-3">
<h3 id="org33f1ded"><span class="section-number-3">13.1.</span> MPFI interval arithmetic better alternative</h3>
</div>
</div>
<div id="outline-container-org09920d3" class="outline-2">
<h2 id="org09920d3"><span class="section-number-2">14.</span> wktpqb</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org282baa5" class="outline-3">
<h3 id="org282baa5"><span class="section-number-3">14.1.</span> needs a new approach</h3>
</div>
<div id="outline-container-org6076d63" class="outline-3">
<h3 id="org6076d63"><span class="section-number-3">14.2.</span> Verifying edge construction (con't.)</h3>
</div>
<div id="outline-container-org0966d09" class="outline-3">
<h3 id="org0966d09"><span class="section-number-3">14.3.</span> 'gcd' algorithm doesn't work</h3>
</div>
</div>
<div id="outline-container-org654b004" class="outline-2">
<h2 id="org654b004"><span class="section-number-2">15.</span> Compilers</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orgf86cbb5" class="outline-3">
<h3 id="orgf86cbb5"><span class="section-number-3">15.1.</span> Started extracting C++ standard grammar</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-org14e251d" class="outline-4">
<h4 id="org14e251d"><span class="section-number-4">15.1.1.</span> Interesting how the grammar is not completely formal.</h4>
</div>
<div id="outline-container-org233aa70" class="outline-4">
<h4 id="org233aa70"><span class="section-number-4">15.1.2.</span> Extracting from latex sources.</h4>
</div>
</div>
<div id="outline-container-org973ecf4" class="outline-3">
<h3 id="org973ecf4"><span class="section-number-3">15.2.</span> Started hand written WSN parser</h3>
</div>
</div>
<div id="outline-container-org12c0782" class="outline-2">
<h2 id="org12c0782"><span class="section-number-2">16.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org072c4f1" class="outline-3">
<h3 id="org072c4f1"><span class="section-number-3">16.1.</span> Mounted on mill - ready or testing</h3>
</div>
<div id="outline-container-org167650c" class="outline-3">
<h3 id="org167650c"><span class="section-number-3">16.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-16-2">
</div>
<div id="outline-container-org61842b6" class="outline-4">
<h4 id="org61842b6"><span class="section-number-4">16.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-orgf062c5b" class="outline-4">
<h4 id="orgf062c5b"><span class="section-number-4">16.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-16-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
<div id="outline-container-org1873644" class="outline-3">
<h3 id="org1873644"><span class="section-number-3">16.3.</span> Alternative architecture</h3>
<div class="outline-text-3" id="text-16-3">
</div>
<div id="outline-container-org526b5c5" class="outline-4">
<h4 id="org526b5c5"><span class="section-number-4">16.3.1.</span> Split off stepper motor controller to separate board</h4>
<div class="outline-text-4" id="text-16-3-1">
<p>
Increase latency tolerance on controller
</p>
</div>
</div>
<div id="outline-container-org00332f6" class="outline-4">
<h4 id="org00332f6"><span class="section-number-4">16.3.2.</span> Use emc2 MODBUS/TCP protocol for stepper and other IO</h4>
</div>
</div>
</div>
<div id="outline-container-org810e668" class="outline-2">
<h2 id="org810e668"><span class="section-number-2">17.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orga8ba7d3" class="outline-3">
<h3 id="orga8ba7d3"><span class="section-number-3">17.1.</span> Need a VPS with static IP</h3>
<div class="outline-text-3" id="text-17-1">
</div>
<div id="outline-container-org4d2c76f" class="outline-4">
<h4 id="org4d2c76f"><span class="section-number-4">17.1.1.</span> OpenVPN to tie it all together</h4>
</div>
<div id="outline-container-orgaf9c4ab" class="outline-4">
<h4 id="orgaf9c4ab"><span class="section-number-4">17.1.2.</span> Gandi VPS datacenter in France so connection crosses international border</h4>
<div class="outline-text-4" id="text-17-1-2">
<p>
What are the data security and privacy tradeoffs?
</p>
</div>
</div>
<div id="outline-container-orgdf00526" class="outline-4">
<h4 id="orgdf00526"><span class="section-number-4">17.1.3.</span> Prototype VPS on existing hardware</h4>
<div class="outline-text-4" id="text-17-1-3">
</div>
<ol class="org-ol">
<li><a id="org84b2cd6"></a>OpenStack?<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org7a63a50" class="outline-2">
<h2 id="org7a63a50"><span class="section-number-2">18.</span> CA Root Key Generation</h2>
<div class="outline-text-2" id="text-18">
<p>
Nice to have an appliance that manages keys.
Need to make this simple. Really don't have time for a science project.
Could just buy something from nitrokey <a href="https://www.nitrokey.com/">https://www.nitrokey.com/</a>
But I really don't want to spend money on it of I have hardware already.
</p>
</div>
<div id="outline-container-orgd887f53" class="outline-3">
<h3 id="orgd887f53"><span class="section-number-3">18.1.</span> Need to be clear on security properties.</h3>
<div class="outline-text-3" id="text-18-1">
<p>
Definitely protect against remote access to private keys. How strong
does the protection against <b>local</b> access need to be?
</p>
</div>
</div>
<div id="outline-container-org03b1c3c" class="outline-3">
<h3 id="org03b1c3c"><span class="section-number-3">18.2.</span> Simple hardware.</h3>
<div class="outline-text-3" id="text-18-2">
</div>
<div id="outline-container-orgbc8041b" class="outline-4">
<h4 id="orgbc8041b"><span class="section-number-4">18.2.1.</span> Use some modern device TPM</h4>
<div class="outline-text-4" id="text-18-2-1">
<p>
Need to export data for backup.
</p>
</div>
</div>
<div id="outline-container-org4427f48" class="outline-4">
<h4 id="org4427f48"><span class="section-number-4">18.2.2.</span> Or something that uses PKCS11 interface</h4>
</div>
</div>
<div id="outline-container-org323a955" class="outline-3">
<h3 id="org323a955"><span class="section-number-3">18.3.</span> USB Serial interface only but no credentials across USB I/F.</h3>
<div class="outline-text-3" id="text-18-3">
<p>
But this potentially exposes the hardware to remote access via the USB
I/F when connected.
</p>
</div>
</div>
<div id="outline-container-org92c6025" class="outline-3">
<h3 id="org92c6025"><span class="section-number-3">18.4.</span> Use Sneakernet</h3>
<div class="outline-text-3" id="text-18-4">
<p>
Doesn't scale. Should use something so cert updates are automatable.
But that's a science project it seems.
</p>
</div>
</div>
</div>
<div id="outline-container-org5231aa6" class="outline-2">
<h2 id="org5231aa6"><span class="section-number-2">19.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-org6a8b5be" class="outline-3">
<h3 id="org6a8b5be"><span class="section-number-3">19.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-19-1">
</div>
<div id="outline-container-orga519703" class="outline-4">
<h4 id="orga519703"><span class="section-number-4">19.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-org092624e" class="outline-3">
<h3 id="org092624e"><span class="section-number-3">19.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
<div id="outline-container-orgc38b502" class="outline-3">
<h3 id="orgc38b502"><span class="section-number-3">19.3.</span> maybe should treat as platform for concatinative synthesis</h3>
</div>
<div id="outline-container-org6b3cff2" class="outline-3">
<h3 id="org6b3cff2"><span class="section-number-3">19.4.</span> maybe should just accept the limitations and work with it</h3>
<div class="outline-text-3" id="text-19-4">
<p>
One should not be disappointed that a guitar can't sound like a flute.
</p>
</div>
</div>
</div>
<div id="outline-container-org30c96a9" class="outline-2">
<h2 id="org30c96a9"><span class="section-number-2">20.</span> gat</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org68bf08e" class="outline-3">
<h3 id="org68bf08e"><span class="section-number-3">20.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-org49a3f05" class="outline-2">
<h2 id="org49a3f05"><span class="section-number-2">21.</span> RIOT drivers</h2>
<div class="outline-text-2" id="text-21">
<p>
Implemented - needs testing.
</p>
</div>
<div id="outline-container-org906e3fa" class="outline-3">
<h3 id="org906e3fa"><span class="section-number-3">21.1.</span> WS2801</h3>
</div>
<div id="outline-container-org154db26" class="outline-3">
<h3 id="org154db26"><span class="section-number-3">21.2.</span> Velleman KA03</h3>
</div>
<div id="outline-container-org87a89a6" class="outline-3">
<h3 id="org87a89a6"><span class="section-number-3">21.3.</span> Velleman KA05</h3>
</div>
</div>
<div id="outline-container-org1c81c12" class="outline-2">
<h2 id="org1c81c12"><span class="section-number-2">22.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-22">
</div>
