status/2023/1229.html
<div id="outline-container-org0d635c4" class="outline-3">
<h3 id="org0d635c4"><span class="section-number-3">22.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-orgb13e76f" class="outline-3">
<h3 id="orgb13e76f"><span class="section-number-3">22.2.</span> Planning software.</h3>
</div>
<div id="outline-container-org20065e3" class="outline-3">
<h3 id="org20065e3"><span class="section-number-3">22.3.</span> Received STM32F767 Nucleo144 with Ethernet.</h3>
<div class="outline-text-3" id="text-22-3">
</div>
<div id="outline-container-orgcfa97b2" class="outline-4">
<h4 id="orgcfa97b2"><span class="section-number-4">22.3.1.</span> Test program running.</h4>
</div>
<div id="outline-container-org28106e3" class="outline-4">
<h4 id="org28106e3"><span class="section-number-4">22.3.2.</span> Need to consider CoAP multicast discovery.</h4>
</div>
<div id="outline-container-org84f1c0c" class="outline-4">
<h4 id="org84f1c0c"><span class="section-number-4">22.3.3.</span> Consider simpler architecture with STM32F767 as a 'hub'.</h4>
</div>
<div id="outline-container-orgf186dfa" class="outline-4">
<h4 id="orgf186dfa"><span class="section-number-4">22.3.4.</span> Consider CAN interface to hub.</h4>
</div>
</div>
</div>
<div id="outline-container-org507b58d" class="outline-2">
<h2 id="org507b58d"><span class="section-number-2">23.</span> AMD 2900 bitslice computing</h2>
<div class="outline-text-2" id="text-23">
</div>
<div id="outline-container-org910a981" class="outline-3">
<h3 id="org910a981"><span class="section-number-3">23.1.</span> Probably my oldest uncompleted project</h3>
</div>
<div id="outline-container-org24cd4f8" class="outline-3">
<h3 id="org24cd4f8"><span class="section-number-3">23.2.</span> Exploring possibilities for something constructive</h3>
<div class="outline-text-3" id="text-23-2">
<p>
Create verilog models for 2903/2910 and verify against hardware?
</p>
</div>
</div>
</div>
<div id="outline-container-orgaaef45e" class="outline-2">
<h2 id="orgaaef45e"><span class="section-number-2">24.</span> Hitachi HD68B09E CPU</h2>
<div class="outline-text-2" id="text-24">
</div>
<div id="outline-container-orgc1e37ce" class="outline-3">
<h3 id="orgc1e37ce"><span class="section-number-3">24.1.</span> RAM/UART/IO</h3>
</div>
<div id="outline-container-orgac3d261" class="outline-3">
<h3 id="orgac3d261"><span class="section-number-3">24.2.</span> Started schematic</h3>
<div class="outline-text-3" id="text-24-2">
</div>
<div id="outline-container-orgeea67ad" class="outline-4">
<h4 id="orgeea67ad"><span class="section-number-4">24.2.1.</span> Standard peripheral set for 8 bit CPU bringups</h4>
<div class="outline-text-4" id="text-24-2-1">
<p>
Board schematic planned - need Kicad symbols
</p>
</div>
</div>
</div>
<div id="outline-container-org235fcce" class="outline-3">
<h3 id="org235fcce"><span class="section-number-3">24.3.</span> Arduino Mega 2560 DMA loader</h3>
<div class="outline-text-3" id="text-24-3">
<p>
&#x2026;Along with standard 8 bit loader
</p>
</div>
</div>
<div id="outline-container-org50c687b" class="outline-3">
<h3 id="org50c687b"><span class="section-number-3">24.4.</span> Generate quadrature clock directly</h3>
</div>
<div id="outline-container-org0d409fe" class="outline-3">
<h3 id="org0d409fe"><span class="section-number-3">24.5.</span> Full Bus SW Emulation infeasible</h3>
<div class="outline-text-3" id="text-24-5">
<p>
6809 1000ns maximum cycle time too short
</p>
</div>
</div>
</div>
<div id="outline-container-org449cd66" class="outline-2">
<h2 id="org449cd66"><span class="section-number-2">25.</span> Rockwell R65F11</h2>
<div class="outline-text-2" id="text-25">
</div>
<div id="outline-container-org47340f5" class="outline-3">
<h3 id="org47340f5"><span class="section-number-3">25.1.</span> Still evaluating.</h3>
</div>
<div id="outline-container-orge48761e" class="outline-3">
<h3 id="orge48761e"><span class="section-number-3">25.2.</span> Dev board</h3>
<div class="outline-text-3" id="text-25-2">
<p>
Reverse engineered some of a mostly fully built development board with
one part missing. As near as I can tell, that one part is some sort of
programmable address decoder with a pinout that does not correspond to
any part I can find. Kind of like a GAL but with inputs on top and
outputs on bottom (as opposed to left and right in a standard GAL). I
have no idea what the provenance of this board is and if it ever
worked.
</p>
</div>
</div>
</div>
<div id="outline-container-orgec51adf" class="outline-2">
<h2 id="orgec51adf"><span class="section-number-2">26.</span> PLD programming</h2>
<div class="outline-text-2" id="text-26">
<p>
Looks like Atmel 16V8 is the last 5V PLD part left standing. Maybe not
surprising that there still doesn't appear to be a fully open source
tool chain for programming. How hard could it be? (!) Could next-pnr
generic help? Might be easier to use espresso for logic array and program
output logic bits directly for simple stuff.
</p>
</div>
</div>
<div id="outline-container-org08090fe" class="outline-2">
<h2 id="org08090fe"><span class="section-number-2">27.</span> EPROM Programming</h2>
<div class="outline-text-2" id="text-27">
<p>
Found some software for Needham programmer. Need to check electrolytic
caps on ISA board.
</p>
</div>
</div>
<div id="outline-container-orgff429c1" class="outline-2">
<h2 id="orgff429c1"><span class="section-number-2">28.</span> POSIT</h2>
<div class="outline-text-2" id="text-28">
</div>
<div id="outline-container-org62b513d" class="outline-3">
<h3 id="org62b513d"><span class="section-number-3">28.1.</span> Use POSITs for YRX?</h3>
<div class="outline-text-3" id="text-28-1">
<p>
No. Existing library is fine.
</p>
</div>
</div>
</div>
<div id="outline-container-org1e70461" class="outline-2">
<h2 id="org1e70461"><span class="section-number-2">29.</span> MAME</h2>
<div class="outline-text-2" id="text-29">
</div>
<div id="outline-container-org02a5c12" class="outline-3">
<h3 id="org02a5c12"><span class="section-number-3">29.1.</span> Subset builds in debug mode</h3>
<div class="outline-text-3" id="text-29-1">
<p>
Full debug fails - not enough disk or memory.
</p>
</div>
</div>
<div id="outline-container-org18bc0f4" class="outline-3">
<h3 id="org18bc0f4"><span class="section-number-3">29.2.</span> gs6809 serial IO doesn't work right with PTY and other streams</h3>
</div>
<div id="outline-container-orgaff1b1c" class="outline-3">
<h3 id="orgaff1b1c"><span class="section-number-3">29.3.</span> ampro (Z80/Z80SIO) <b>does</b> work with PTY</h3>
</div>
<div id="outline-container-org93d337d" class="outline-3">
<h3 id="org93d337d"><span class="section-number-3">29.4.</span> Evaluating what is needed for other emulators.</h3>
</div>
</div>
<div id="outline-container-orgcf03a17" class="outline-2">
<h2 id="orgcf03a17"><span class="section-number-2">30.</span> More project ideas</h2>
<div class="outline-text-2" id="text-30">
</div>
<div id="outline-container-org1a2d75a" class="outline-3">
<h3 id="org1a2d75a"><span class="section-number-3">30.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-30-1">
<p>
Good excuse for floating point ALU design. Try posit format?
</p>
</div>
</div>
<div id="outline-container-org3749c71" class="outline-3">
<h3 id="org3749c71"><span class="section-number-3">30.2.</span> GMPForth ports to simulators</h3>
<div class="outline-text-3" id="text-30-2">
</div>
<div id="outline-container-org330471d" class="outline-4">
<h4 id="org330471d"><span class="section-number-4">30.2.1.</span> SIMH for some targets (vax)</h4>
</div>
<div id="outline-container-org6207de5" class="outline-4">
<h4 id="org6207de5"><span class="section-number-4">30.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-30-2-2">
<p>
How to support ersatz systems?
</p>
</div>
</div>
<div id="outline-container-org3b1d2ca" class="outline-4">
<h4 id="org3b1d2ca"><span class="section-number-4">30.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org5005783" class="outline-3">
<h3 id="org5005783"><span class="section-number-3">30.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-30-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-org05bb87d" class="outline-3">
<h3 id="org05bb87d"><span class="section-number-3">30.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org63ef5fe" class="outline-3">
<h3 id="org63ef5fe"><span class="section-number-3">30.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-30-5">
</div>
<div id="outline-container-orgb67617c" class="outline-4">
<h4 id="orgb67617c"><span class="section-number-4">30.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-org5c26a04" class="outline-4">
<h4 id="org5c26a04"><span class="section-number-4">30.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org96851b8" class="outline-3">
<h3 id="org96851b8"><span class="section-number-3">30.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-30-6">
</div>
<div id="outline-container-org31090e4" class="outline-4">
<h4 id="org31090e4"><span class="section-number-4">30.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-orgfa80f10" class="outline-4">
<h4 id="orgfa80f10"><span class="section-number-4">30.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-org62170b4" class="outline-4">
<h4 id="org62170b4"><span class="section-number-4">30.6.3.</span> CPUs with totally async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-orgf6b5e61" class="outline-4">
<h4 id="orgf6b5e61"><span class="section-number-4">30.6.4.</span> Could use small footprint monitor in asm (gmpmon?)</h4>
</div>
</div>
<div id="outline-container-org660145e" class="outline-3">
<h3 id="org660145e"><span class="section-number-3">30.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-30-7">
</div>
<div id="outline-container-org2e4c2d2" class="outline-4">
<h4 id="org2e4c2d2"><span class="section-number-4">30.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-30-7-1">
<p>
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
</p>
</div>
</div>
<div id="outline-container-org8e8efa9" class="outline-4">
<h4 id="org8e8efa9"><span class="section-number-4">30.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-30-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-orgf786543" class="outline-4">
<h4 id="orgf786543"><span class="section-number-4">30.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-30-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-orge273306" class="outline-4">
<h4 id="orge273306"><span class="section-number-4">30.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-30-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
MAME emulator possibilities?
</p>
</div>
</div>
<div id="outline-container-orgf568a15" class="outline-4">
<h4 id="orgf568a15"><span class="section-number-4">30.7.5.</span> NMIX-0016</h4>
<div class="outline-text-4" id="text-30-7-5">
<p>
Works. Found original prom in a parts stash(!).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org09a5770" class="outline-2">
<h2 id="org09a5770"><span class="section-number-2">31.</span> David Davies</h2>
<div class="outline-text-2" id="text-31">
</div>
<div id="outline-container-org4890159" class="outline-3">
<h3 id="org4890159"><span class="section-number-3">31.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org3321d62" class="outline-3">
<h3 id="org3321d62"><span class="section-number-3">31.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-orgffb0587" class="outline-3">
<h3 id="orgffb0587"><span class="section-number-3">31.3.</span> Next hearing 2/26/2024</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2024-01-06 Sat 06:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>